meshing/snappyHex_mesh/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-20.0 -30.0 -0.1)
    ( 60.0 -30.0 -0.1)
    ( 60.0  30.0 -0.1)
    (-20.0  30.0 -0.1)
    (-20.0 -30.0  0.1)
    ( 60.0 -30.0  0.1)
    ( 60.0  30.0  0.1)
    (-20.0  30.0  0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (120 60 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch topAndBottom
    (
        (3 7 6 2)
        (1 5 4 0)
    )

    patch inlet
    (
        (0 4 7 3)
    )

    patch outlet
    (
        (2 6 5 1)
    )

    empty front
    (
        (4 5 6 7)
    )

    empty back
    (
        (0 3 2 1)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
